app/controllers/admin/matrix_content_types_controller.rb

SELECT "matrix_content_types".* FROM "matrix_content_types"
---
  def index
    @matrix_content_types = MatrixContentType.all

SELECT "matrix_content_types".* FROM "matrix_content_types" WHERE "matrix_content_types"."content_type_id" = 1 LIMIT 1
---
  def search
    if params[:content_type_id]
      @matrix_content_types = MatrixContentType.find_by_content_type_id(params[:content_type_id])

SELECT "matrix_content_types".* FROM "matrix_content_types" WHERE "matrix_content_types"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @matrix_content_type = MatrixContentType.find(params[:id])

SELECT "matrix_content_types".* FROM "matrix_content_types" WHERE "matrix_content_types"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @matrix_content_type = MatrixContentType.find(params[:id])

INSERT INTO "matrix_content_types" ("content_type_id", "created_at", "matter_father_id", "matter_id", "updated_at", "workflow_state") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @matrix_content_type = MatrixContentType.new(params[:matrix_content_type])

    respond_to do |format|
      if @matrix_content_type.save

SELECT "matrix_content_types".* FROM "matrix_content_types" WHERE "matrix_content_types"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "matrix_content_types" WHERE "matrix_content_types"."id" = ?  [["id", 4]]
---
  def destroy
    @matrix_content_type = MatrixContentType.find(params[:id])
    @matrix_content_type.destroy