app/controllers/admin/matters_controller.rb

  def index
    @matters = Matter.all
---
SELECT "matters".* FROM "matters"

  def search
    if (params[:matter_fathers] == "true")
      @matters = Matter.where("matter_father_id is null")
---
SELECT "matters".* FROM "matters" WHERE "matters"."matter_father_id" IS NULL LIMIT 1

  def show
    @matter = Matter.find(params[:id])
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @matter = Matter.find(params[:id])
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @matter = Matter.new(params[:matter])

    respond_to do |format|

      if @matter.save
---
INSERT INTO "matters" ("created_at", "icon_content_type", "icon_file_name", "icon_file_size", "icon_updated_at", "matter_father_id", "name", "updated_at", "workflow_state") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
     @matter = Matter.find(params[:id])

    #Transitions of workflow
    case params[:submit_type]
    when 'draft'
    else
      @matter.submit!
    end

    respond_to do |format|
      if @matter.update_attributes(params[:matter])
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "matters" SET "workflow_state" = 'published', "updated_at" = '2012-08-14 16:44:25.471388' WHERE "matters"."id" = 1

  def destroy
    @matter = Matter.find(params[:id])
    @matter.destroy
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "matters" WHERE "matters"."id" = ?  [["id", 2]]