app/views/admin/matters/_form.html.erb

SELECT "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT 1  [["id", "1"]]
---
    <%= f.label :matter_father_id %><br />
    <%= select("matter","matter_father_id", Matter.where("id <> ? and matter_father_id is null", (@matter.id == nil ? "" : @matter.id)).collect {|m| [m.name, m.id]}, :include_blank => t(:none)) %><br/>