app/controllers/asks_controller.rb

SELECT "asks".* FROM "asks"
---
  def index
    @asks = Ask.all

SELECT "asks".* FROM "asks" WHERE "asks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @ask = Ask.find(params[:id])

SELECT "asks".* FROM "asks" WHERE "asks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @ask = Ask.find(params[:id])

INSERT INTO "asks" ("created_at", "description", "details", "updated_at", "workflow_state") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 13 Jun 2012 10:53:52 UTC +00:00], ["description", "adasda"], ["details", "sdfsdfsf"], ["updated_at", Wed, 13 Jun 2012 10:53:52 UTC +00:00], ["workflow_state", "published"]]
---
  def create
    @ask = Ask.new(params[:ask])

    #Transitions of workflow
    case params[:submit_type]
    when 'draft'
      @ask.save_as_draft!

SELECT "asks".* FROM "asks" WHERE "asks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "asks" SET "workflow_state" = 'published', "updated_at" = '2012-06-13 15:54:54.412923' WHERE "asks"."id" = 7
---
  def update
    @ask = Ask.find(params[:id])

    raise Exceptions::IsNotAuthorError unless current_user.has_role? :author, @ask

    #Transitions of workflow
    case params[:submit_type]
    when 'draft'
      @ask.save_as_draft!

SELECT "asks".* FROM "asks" WHERE "asks"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "asks" WHERE "asks"."id" = ?  [["id", 2]]
---
  def destroy
    @ask = Ask.find(params[:id])

    raise Exceptions::IsNotAuthorError unless current_user.has_role? :author, @ask

    @ask.destroy